// 88.  Заменить все вхождения подстроки w в строке st на строку v.
//Вывести на экран первоначальную строку и конечную строку


string s=Console.ReadLine();
System.Console.WriteLine($"Первоначальная строка {s}");
System.Console.WriteLine($"Измененная строка {s.Replace('a', 'b')}"); 

